In [2]:
import pandas as pd
import numpy as np

ser=pd.Series(list("Clarusway"))

In [3]:
ser

0    C
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

In [5]:
ser.sort_index(ascending=True) #.sort_values : Sort a Series in ascending or descending order by the values

0    C
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

In [6]:
ser.sort_index(ascending=False)

8    y
7    a
6    w
5    s
4    u
3    r
2    a
1    l
0    C
dtype: object

In [8]:
ser.isin(['w'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
dtype: bool

In [9]:
ser.keys()

RangeIndex(start=0, stop=9, step=1)

In [13]:
ser.values #.values : Return Series as ndarray or ndarray-like depending on the dtype

array(['C', 'l', 'a', 'r', 'u', 's', 'w', 'a', 'y'], dtype=object)

In [14]:
list(ser.items()) #.items : This method returns an iterable tuple (index, value)

[(0, 'C'),
 (1, 'l'),
 (2, 'a'),
 (3, 'r'),
 (4, 'u'),
 (5, 's'),
 (6, 'w'),
 (7, 'a'),
 (8, 'y')]

In [25]:
df=pd.DataFrame(np.arange(1,24,2).reshape(3,4),columns=['var1','var2','var3','var4'])

In [26]:
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [27]:
df.head(2)

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15

In [28]:
df.tail(2)

   var1  var2  var3  var4
1     9    11    13    15
2    17    19    21    23

In [32]:
df.sample(n=2) #.sample : Return a random sample of items from an axis of object

   var1  var2  var3  var4
2    17    19    21    23
0     1     3     5     7

In [33]:
df.shape

(3, 4)

In [53]:
np.random.seed(101)
df=pd.DataFrame(np.random.randint(9,size=(5,4)),
                index='A B C D E'.split(),columns='W X Y Z'.split())

In [54]:
df

   W  X  Y  Z
A  1  6  7  8
B  4  8  5  0
C  5  8  1  3
D  8  3  3  2
E  8  3  7  0

In [55]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [56]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [57]:
df.shape

(5, 4)

In [58]:
df.size

20

In [59]:
df.ndim

2

In [60]:
df.reset_index()

  index  W  X  Y  Z
0     A  1  6  7  8
1     B  4  8  5  0
2     C  5  8  1  3
3     D  8  3  3  2
4     E  8  3  7  0

In [61]:
newindx='CA NT WY OR CO'.split()
newindx

['CA', 'NT', 'WY', 'OR', 'CO']

In [62]:
df['newidx']=newindx

In [63]:
df

   W  X  Y  Z newidx
A  1  6  7  8     CA
B  4  8  5  0     NT
C  5  8  1  3     WY
D  8  3  3  2     OR
E  8  3  7  0     CO

In [64]:
df.set_index('newidx')

        W  X  Y  Z
newidx
CA      1  6  7  8
NT      4  8  5  0
WY      5  8  1  3
OR      8  3  3  2
CO      8  3  7  0

In [65]:
df

   W  X  Y  Z newidx
A  1  6  7  8     CA
B  4  8  5  0     NT
C  5  8  1  3     WY
D  8  3  3  2     OR
E  8  3  7  0     CO

In [66]:
df['W']

A    1
B    4
C    5
D    8
E    8
Name: W, dtype: int32

In [67]:
df.W

A    1
B    4
C    5
D    8
E    8
Name: W, dtype: int32

In [68]:
df.iloc[1,0]

4

In [69]:
df.loc['B','W']

4

In [71]:
df

   W  X  Y  Z newidx
A  1  6  7  8     CA
B  4  8  5  0     NT
C  5  8  1  3     WY
D  8  3  3  2     OR
E  8  3  7  0     CO

In [73]:
df.loc['D','Z']

2

In [74]:
df[df.Y<6]

   W  X  Y  Z newidx
B  4  8  5  0     NT
C  5  8  1  3     WY
D  8  3  3  2     OR

In [80]:
df[['X','Z']]

   X  Z
A  6  8
B  8  0
C  8  3
D  3  2
E  3  0

In [81]:
import seaborn as sns

In [82]:
df=sns.load_dataset('iris')
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [87]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [88]:
df.shape

(150, 5)

In [89]:
len(df)

150

In [90]:
df.species.value_counts() #df.col.value_counts(): Return a Series containing counts of unique values.

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [91]:
df.mean()

C:\Users\hp\AppData\Local\Temp/ipykernel_28544/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [93]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [94]:
df.sepal_length.sum()

876.5

In [95]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [97]:
#df.col.unique(): Hash table-based unique. Uniques are 
#returned in order of appearance. This does NOT sort

In [98]:
df.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [99]:
#df.isnull().sum(): Detect missing values. 
#Return a total number of missing values in each column.#

In [104]:
df.drop('sepal_length',axis=1).head()

   sepal_width  petal_length  petal_width species
0          3.5           1.4          0.2  setosa
1          3.0           1.4          0.2  setosa
2          3.2           1.3          0.2  setosa
3          3.1           1.5          0.2  setosa
4          3.6           1.4          0.2  setosa

In [105]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [106]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [107]:
df.drop(['B','C'],axis=1)

   A   D
0  0   3
1  4   7
2  8  11